Public Attributes | List of all members
API_MEPSystemType Struct Reference
Attribute Management
MEP System attribute representation. More...
#include <APIdefs_Attributes.h>
 Public Attributes
API_Attr_Head  | head
Specifies the index and the name of the MEP System.
bool  | isForDuctwork
MEP System available for ductwork.
bool  | isForPipework
MEP System available for pipework.
bool  | isForCabling
MEP System available for cabling.
short  | contourPen
The index of the contour pen [1..255].
short  | fillPen
The index of the fill (foreground) pen [1..255].
short  | fillBgPen
Index of the background pen [0..255]. The special 0 value means transparent background.
short  | centerLinePen
The index of the center line pen [1..255].
API_AttributeIndex  | fillInd
The index of the fill pattern attribute (1..n, where n is the number of simple fill attributes).
API_AttributeIndex  | centerLTypeInd
The index of the center line type attribute (1..n, where n is the number of simple line attributes).
API_AttributeIndex  | materialInd
The index of the body material attribute (1..n, where n is the number of simple material attributes).
API_AttributeIndex  | insulationMatInd
The index of the insulation material attribute (1..n, where n is the number of simple material attributes).
Detailed Description
MEP System attribute representation.
Remarks
One MEP System always exists, i.e. you cannot delete the last MEP System attribute. There is no additional data assigned to MEP System attributes in the API_AttributeDef structure.
Member Data Documentation
◆ centerLinePen
 API_MEPSystemType::centerLinePen
The index of the center line pen [1..255].
◆ centerLTypeInd
 API_MEPSystemType::centerLTypeInd
The index of the center line type attribute (1..n, where n is the number of simple line attributes).
◆ contourPen
 API_MEPSystemType::contourPen
The index of the contour pen [1..255].
◆ fillBgPen
 API_MEPSystemType::fillBgPen
Index of the background pen [0..255]. The special 0 value means transparent background.
◆ fillInd
 API_MEPSystemType::fillInd
The index of the fill pattern attribute (1..n, where n is the number of simple fill attributes).
◆ fillPen
 API_MEPSystemType::fillPen
The index of the fill (foreground) pen [1..255].
◆ head
 API_MEPSystemType::head
Specifies the index and the name of the MEP System.
◆ insulationMatInd
 API_MEPSystemType::insulationMatInd
The index of the insulation material attribute (1..n, where n is the number of simple material attributes).
◆ isForCabling
 API_MEPSystemType::isForCabling
MEP System available for cabling.
◆ isForDuctwork
 API_MEPSystemType::isForDuctwork
MEP System available for ductwork.
◆ isForPipework
 API_MEPSystemType::isForPipework
MEP System available for pipework.
◆ materialInd
 API_MEPSystemType::materialInd
The index of the body material attribute (1..n, where n is the number of simple material attributes).